Tekla.Structures.DirectManipulation.Adapter.Controls.PreviewProvider
The Tekla.Structures.DirectManipulation.Adapter.Controls.PreviewProvider class provides the preview for DM tools for selected objects.

Tekla.Structures.DirectManipulation.Adapter.Controls.PreviewProvider.contextualTools
The contextual tools preview provider.

Tekla.Structures.DirectManipulation.Adapter.Controls.PreviewProvider.ContextualTools
Gets the contextual tools preview provider.